## Pandas Append() Function

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'A':[1,2,3],'B':[10,20,30]})
df1

   A   B
0  1  10
1  2  20
2  3  30

In [4]:
df2 = pd.DataFrame({'C':[4,5,6],'D':[140,50,60]})
df2

   C    D
0  4  140
1  5   50
2  6   60

In [5]:
display(df1,df2)

   C    D
0  4  140
1  5   50
2  6   60

   C    D
0  4  140
1  5   50
2  6   60

In [8]:
pd.concat([df1, df2], ignore_index=False)

   C    D
0  4  140
1  5   50
2  6   60
0  4  140
1  5   50
2  6   60

In [9]:
pd.concat([df1, df2], ignore_index=True)

   C    D
0  4  140
1  5   50
2  6   60
3  4  140
4  5   50
5  6   60

In [10]:
pd.concat([df1, df2], ignore_index=False,sort=False)

   C    D
0  4  140
1  5   50
2  6   60
0  4  140
1  5   50
2  6   60